app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments"

  def create
    @comment = current_user.comments.build params[:comment]
    if @comment.save
---
INSERT INTO "comments" ("created_at", "title", "body", "updated_at", "votes_count", "user_id") VALUES('2010-07-19 04:47:12', 'Whine Whine Whine', 'I don''t like any of this! What am I still doing here?', '2010-07-19 04:47:12', 0, 1)

  def add_subcomment
     @subcomment = Comment.find(params[:id]).subcomments.new(params[:subcomment])
     @subcomment.user_id = current_user.id
     @subcomment.save
---
SELECT * FROM "comments" WHERE ("comments"."id" = 3)
INSERT INTO "subcomments" ("created_at", "body", "updated_at", "user_id", "comment_id") VALUES('2010-08-09 04:58:59', '', '2010-08-09 04:58:59', NULL, 3)