app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT "comments".* FROM "comments" INNER JOIN "votes" ON "comments".id = "votes".comment_id WHERE (("votes".user_id = 1)) ORDER BY votes.id DESC LIMIT 6
---
  def show
    @user = User.find(params[:id])
    @comments_submitted = @user.comments.find(:all,
        :limit => 6, :order => 'comments.id DESC')