app/controllers/votes_controller.rb

SELECT * FROM "comments" WHERE ("comments"."id" = 2)
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "comment_id") VALUES('2010-07-18 19:07:42', '2010-07-18 19:07:42', NULL, 2)
UPDATE "comments" SET "votes_count" = COALESCE("votes_count", 0) + 1 WHERE ("id" = 4)
UPDATE "users" SET "updated_at" = '2010-08-12 06:00:18', "votes_left" = -1 WHERE "id" = 1
---
  def create
    @comment = Comment.find(params[:comment_id])
    @comment.votes.create(:user => current_user)
    @comment.user.decrement_votes_left